[
  {
    "Name": "Student Name",
    "Instagram": "Social Media",
    "Website": "Website",
    "Project Description": "Project Description",
    "URLs": [
      "Image URL1",
      "Image URL 2",
      "Image URL 3",
      "Image URL 4",
      "Image URL 5"
    ]
  },
  {
    "Name": "Alyssa Dixon",
    "Instagram": "https://www.instagram.com/alyssa_dixon__/",
    "Website": "https://alyssadixon.org/",
    "Project Description": "An exploration of digital typeface and screenprint practices translated into a quilt blanket.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/QuiltScrapped-Typeface%20-%20Alyssa%20Dixon.tif?updatedAt=1714488896778",
      "https://ik.imagekit.io/openhouse/scan_2024-04-11_17-34-02_Page_1%20-%20Alyssa%20Dixon.jpg?updatedAt=1714488908471",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Ariadna Perez",
    "Instagram": "https://www.instagram.com/sakurariadna?igsh=YTI1YzN1cDh5dXJw",
    "Website": "https://ariadnaperez.cargo.site/",
    "Project Description": "<i>Market Marvel</i> is a brand that produces products that parody grocery store items, based on my experience of working in a grocery store. To relieve myself from boredom and stress, I've become fixated on elements within where I worked: food packaging, fresh produce and meat, and pre-made food. I've translated this admiration into a line of products that reference these aspects. This line includes sandwich notebooks, fish patches, produce stickers, and food package shirts. Through this work, I share that admiration with my audience and allow them to take a piece of that experience with them.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/20240424_130129%20-%20Ariadna%20Perez.jpg?updatedAt=1714488896984",
      "https://ik.imagekit.io/openhouse/Shirt%202x2%20-%20Ariadna%20Perez-1-1%20-%20Ariadna%20Perez.jpg?updatedAt=1714488908650",
      "https://ik.imagekit.io/openhouse/Market%20Marvel%20Brand%20assets-01-01%20-%20Ariadna%20Perez.jpg?updatedAt=1714488915919",
      "https://ik.imagekit.io/openhouse/Screenshot_20240424_130628_Drive%20-%20Ariadna%20Perez.jpg?updatedAt=1714488922650",
      ""
    ]
  },
  {
    "Name": "Betsy Kinstle",
    "Instagram": "https://www.instagram.com/be.tsy/",
    "Website": "",
    "Project Description": "<i>steeplechase</i> is a typeface inspired by horses, with accompanying illustrations by me. I was inspired by anatomy, athleticism, and both physical and mental strength. ",
    "URLs": [
      "https://ik.imagekit.io/openhouse/synwebdocument%20-%20Betsy%20Kinstle.jpg?updatedAt=1714488897168",
      "https://ik.imagekit.io/openhouse/synwebdoc2%20-%20Betsy%20Kinstle.jpg?updatedAt=1714488908823",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Bree Dorman",
    "Instagram": "",
    "Website": "https://breed2.github.io/portfolio1/",
    "Project Description": "<i>The Reminiscence Collection</i> website is a comprehensive archive that catalogs over 170 video games, each thoughtfully detailed with information about their developers, publishers, series, platforms, and more. This concept was influenced by a poster and book design I created in Fall 2021, featuring cover images and thorough descriptions. The website elevates user experience by offering features like cover image downloads and zooming capabilities. Additionally, search and sorting tools are easily accessible, found in both the top navigation bar and the consistently positioned game icon sidebar, situated on the left side of each page and revealed upon clicking. It also offers accessibility options including a light/dark mode switch, adjustable font sizes, and text-to-speech functionality. Registered members can engage with the content by liking, commenting, and rating games, while a user-friendly dashboard conveniently tracks these interactions for easy historical access. This platform is a demonstration to my passion for graphic design and my enthusiasm for video gaming, offering a space where others can also appreciate and interact with their beloved games. <a href=\"https://breed2.github.io/reminiscencecollection/\">breed2.github.io/reminiscencecollection/</a>",
    "URLs": [
      "https://ik.imagekit.io/openhouse/Image%201%20-%20Bree%20Dorman.jpg?updatedAt=1714488897331",
      "https://ik.imagekit.io/openhouse/Image%202%20-%20Bree%20Dorman.jpg?updatedAt=1714488908976",
      "https://ik.imagekit.io/openhouse/Image3%20-%20Bree%20Dorman.jpg?updatedAt=1714488916075",
      "https://ik.imagekit.io/openhouse/Image%204%20-%20Bree%20Dorman.jpg?updatedAt=1714488922810",
      "https://ik.imagekit.io/openhouse/Image%205%20-%20Bree%20Dorman.jpg?updatedAt=1714488927022"
    ]
  },
  {
    "Name": "Celia Bourhill",
    "Instagram": "https://www.instagram.com/art.cc.c/",
    "Website": "",
    "Project Description": "<i>Every Day is Christmas</i> is a hardback, coptic bound book composed of multiple interviews with my family members. In these interviews, I explore my family’s ideas, hardships, teachings, memories, and special moments behind raising me. The publication brings a laid-back approach to the interview text, which can be accompanied by the original recorded audio, should the viewer choose to wear the provided headphones. Every Day is Christmas follows my childhood as I discuss the hardships I faced at a young age and how I have overcome them, as well as how the hardships affected my parents and siblings. It delves deeper into my parents’ history and their thought process when it came to raising children. As the viewer follows the winding road, they will encounter laughter, silliness, sadness, tears, love, and many, many family photos. ",
    "URLs": [
      "https://ik.imagekit.io/openhouse/1-1RatioMockup1%20-%20Celia%20Bourhill.jpg?updatedAt=1714488897489",
      "https://ik.imagekit.io/openhouse/1-1RatioMockup2%20-%20Celia%20Bourhill.jpg?updatedAt=1714488909190",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Claire Yang",
    "Instagram": "https://www.instagram.com/kali.clairedesign/",
    "Website": "https://yangcs.myportfolio.com/design-work",
    "Project Description": "<i>KDesign Reel</i> is a curated selection of poster animations I created for my own freelance brand. The animated posters showcase the brand KDesign while creating an ambient, atmospheric vibe. I am using a variety of programs, such as Photoshop, Illustrator, After Effects, Blender, and other mixed mediums, to explore kinetic imaging and what animation can do within my graphic design practice. Each of the animations will share one unique mood and tone to the motion and movement of the piece as a whole. This project is inspired by my growing interest in 3D animation and projection mapping, but for this specific project, I've decided to take a step back and focus on the graphic design side of my practice.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/IMG_8190%20-%20Claire%20Yang.jpg?updatedAt=1714488897650",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Courtney Te",
    "Instagram": "https://www.instagram.com/coverydesigns/",
    "Website": "http://courtneyte.com",
    "Project Description": "<i>21YearsofGirlhood</i>: Girlhood is a transitional and pivotal time in self-discovery and reflection that lingers long into adulthood. With every passing minute, year, and decade that passes, the female experience and what it means to be a girl has been reshaped to fit a constantly changing society. 21YearsofGirlhood explores the digital age of girlhood and its effects on sexuality, mental health, and addiction with key scavenger-hunt-like elements to explore the identity of a young Asian girl growing up in the twenty-first century.\n\n<i>LUCKY ONE</i>: Constructing a reprieve from the narrative of the Asian model minority, LUCKY ONE aims to create a safe space to reshape what it means to be Asian today. It is a multi-modal, community-focused zine, distributed as a physical booklet and an interactive website. ",
    "URLs": [
      "https://ik.imagekit.io/openhouse/IMG_5075%20copy%20-%20Courtney%20Te.jpg?updatedAt=1714488897823",
      "https://ik.imagekit.io/openhouse/girlhood%20website%20copy%20-%20Courtney%20Te.jpg?updatedAt=1714488909373",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Emmeline Osuyah",
    "Instagram": "https://www.instagram.com/em.mieox16/",
    "Website": "https://emmelineosuyah.carrd.co/",
    "Project Description": "My project is based on the theory of love languages, reinterpreting the concept and making it into my own to redistribute to others.\n\nThe concept of love languages for romantic relationships already exists. However, I believe this concept can be adapted and applied to platonic relationships as well. There is very little material on this topic, so l decided to develop my own concepts by learning from other friendship experiences.\n\nFrom my research, I felt people were missing out on a very key component to understanding the deep meaning of friendship as a whole due to the lack of platonic language representation. My project allows access to an approachable package that welcomes them regardless of their knowledge of the concept of different friendship dynamics.\n\nAs a final component, I developed a quiz for people take to discover what their platonic language is before they view the items within the box. When viewing my piece, there are 5 different ways, depending on your preference to learn about each language.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/IMG_6772%20-%20Emmie%20Osuyah.jpg?updatedAt=1714488898015",
      "https://ik.imagekit.io/openhouse/IMG_6775%20-%20Emmie%20Osuyah.jpg?updatedAt=1714488909551",
      "https://ik.imagekit.io/openhouse/IMG_6777%20-%20Emmie%20Osuyah.jpg?updatedAt=1714488916261",
      "https://ik.imagekit.io/openhouse/IMG_6780%20-%20Emmie%20Osuyah.jpg?updatedAt=1714488922998",
      "https://ik.imagekit.io/openhouse/IMG_6774%20-%20Emmie%20Osuyah.jpg?updatedAt=1714488927219"
    ]
  },
  {
    "Name": "Gabby Gilbert",
    "Instagram": "https://www.instagram.com/gxbbsofficixl/",
    "Website": "",
    "Project Description": "<i>Cursed to Find Myself</i> is my own personal breakup memoir that discusses themes of love, betrayal, heartache, and finding one’s self after it’s all over. This story encapsulates my thoughts and feelings during key moments in the midst of and after my relationship with my first love, and how I managed to drag myself out of my depressive slump to find out who I truly was. The book is written to follow a playlist of songs by Olivia Rodrigo, with pages filled with her lyrics to the songs I felt best suited my story and ones that resonated the most with me.It can be read with or without listening to the songs attached to each chapter, but it is just a way to further include the readers into my thoughts and feelings throughout the story, and even now as I look back on everything. If anyone reading this is going through anything similar, just know that you are not alone. Thank you for taking the time to unpack and read my story.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/IMG_0877%20-%20Gabrielle%20Gilbert.jpeg?updatedAt=1714488898159",
      "https://ik.imagekit.io/openhouse/IMG_0893%20-%20Gabrielle%20Gilbert.jpeg?updatedAt=1714488909710",
      "https://ik.imagekit.io/openhouse/IMG_0888%20-%20Gabrielle%20Gilbert.jpeg?updatedAt=1714488916421",
      "https://ik.imagekit.io/openhouse/IMG_0880%20-%20Gabrielle%20Gilbert.jpeg?updatedAt=1714488923131",
      ""
    ]
  },
  {
    "Name": "Gabe Molina ",
    "Instagram": "https://www.instagram.com/gabemart1011?igsh=ZzBxcnk0OXlmM3V0&utm_source=qr",
    "Website": "https://www.gabemolinadesigns.com/",
    "Project Description": "I'm immersing myself in the rich tapestry of my family's history by creating a newsletter based on my El Salvadorian and Ecuadorian heritage. My journey with The Commonwealth Times has been instrumental in igniting my passion for newspaper layout design.\n\nEcuador in particular has a legacy of indigenous civilizations like the Incas and the Quitu-Cara people, who crafted gold artifacts long before the arrival of the Spanish conquistadors.\n\nI use the concept of 'oro' (gold), as a metaphor to represent the invaluable wealth of familial stories and traditions that have been passed down through generations. In addition to writing and designing articles, I plan to create a new family tree to serve as a reference tool for future generations. Therefore, demonstrating the longevity of the project that goes beyond the university wall.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/Square_Newspaper_v02%20-%20Gabriel%20Molina%20-%20Gabriel%20Molina.png?updatedAt=1714488898349",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Henry Ready",
    "Instagram": "https://www.instagram.com/sym.003?igsh=MTU2bHllNTIzNjZlbA==",
    "Website": "https://henryready1006.myportfolio.com/?fbclid=PAZXh0bgNhZW0CMTAAAab_khzeQ5X4-HtPlDImK7awacK-SzjbW3pIB77omkGV4Fyasq0RlfQ1B7A_aem_AcYL3USqf7yRXBuO_wTZQkVL6xpIlYbMoUdkji5uNZjqz6pm6N0Zy6q5rdk8rC7gkMY",
    "Project Description": "This book explores mystery and ambiguity through the use of hidden symbols, signs, and other digital media. It includes content from past and present projects, doctored AI-generated imagery, and reinterpretations of everyday signs and characters. Semiotics, surrealism, and digital art have all played major roles in my inspiration for this project. To communicate these interests, I attempted to blur reality and imagination, through the use of digital collaging. Each collage offers a glimpse into a world where familiar objects gain new significance and messages emerge from the subconscious.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/vdszcsac%20-%20Henry%20Ready.png?updatedAt=1714488898514",
      "https://ik.imagekit.io/openhouse/3B8346A2-B1B2-48CE-AD01-CFD508773F38%20-%20Henry%20Ready.jpeg?updatedAt=1714488909865",
      "https://ik.imagekit.io/openhouse/bbddc%20-%20Henry%20Ready.jpeg?updatedAt=1714488916574",
      "https://ik.imagekit.io/openhouse/efwds%20-%20Henry%20Ready.jpeg?updatedAt=1714488923295",
      ""
    ]
  },
  {
    "Name": "Holiday Price",
    "Instagram": "https://www.instagram.com/holidayprice/",
    "Website": "https://www.behance.net/holidayprice1/",
    "Project Description": "I aimed to delve into the realms of sensory perception, particularly emphasizing the tactile experience, and exploring repetition and patterns. My exploration revolved around discovering the solace, comfort, and sense of connection I find with interacting with my environment and trying to recreate that sense of fulfillment for those participating and interacting in my work. Some of the visual identity taken from personal sense of connection to water based fauna fostered by aquatic environments, feeling a sense of relatability due to these creatures also  engaging with the world perceptually different than other people do at least tactilely. The outcome of all these explorations is a sensory box that you can enter and experience multiple tactile senses on the inside and outside of it. The goal is for the participants and observers to be able to interact with the piece, hopefully engaging in their own unique experience with the piece. The intention is to provide a closed space where the participant can have a moment of stillness, if they desire they can touch and interact with the structure, or they can just enjoy the visual experience.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/image1%20-%20Holiday%20Price.png?updatedAt=1714488898653",
      "https://ik.imagekit.io/openhouse/image2%20-%20Holiday%20Price.png?updatedAt=1714488910015",
      "https://ik.imagekit.io/openhouse/image3%20-%20Holiday%20Price.png?updatedAt=1714488916741",
      "",
      ""
    ]
  },
  {
    "Name": "Inho Park",
    "Instagram": "https://www.instagram.com/par_kino/",
    "Website": "www.inhodesign.com",
    "Project Description": "The <i>Viewport²</i> music player provides a casing for your smartphone that intentionally degrades your technology. You will experience limited functions and worse-off quality, but also rediscover what it means to live in a highly digitized world.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/inho-park-1%20-%20Inho%20Park.jpg?updatedAt=1714488898864",
      "https://ik.imagekit.io/openhouse/inho-park-2%20-%20Inho%20Park.jpg?updatedAt=1714488910177",
      "https://ik.imagekit.io/openhouse/inho-park-3%20-%20Inho%20Park.jpg?updatedAt=1714488916900",
      "",
      ""
    ]
  },
  {
    "Name": "Jack Lwin",
    "Instagram": "",
    "Website": "https://jacklwin.cargo.site/",
    "Project Description": "This binder isn't really about sports. There are plenty of callbacks to the title but the word felt like such a perfect umbrella for what I want to communicate with this project. More than any athletic or historical reference this collection is about process and iteration.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/1%20-%20Jack%20Lwin.jpg?updatedAt=1714488899046",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Jade Stella",
    "Instagram": "https://www.instagram.com/stellerforever/",
    "Website": "https://jadestella.cargo.site/",
    "Project Description": "<i>And here I still stand.</i> A sentiment that has been growing more and more necessary. “I’m here. I’m here and I’m still standing.” When the whole world feels as if it’s floating away and I have nothing to hold on to, how can I reroot myself again? When the things that were once thought as promised, are not, where can I look to find safety again? When everything once grasped tight is lost, how can I trust these hands again? Where can I place my hopes, where can I place my dreams, where can I find a soft place to land?",
    "URLs": [
      "https://ik.imagekit.io/openhouse/synthesis%20web%20photos1%20-%20Jade%20Stella.png?updatedAt=1714488899256",
      "https://ik.imagekit.io/openhouse/synthesis%20web%20photos2%20-%20Jade%20Stella.png?updatedAt=1714488910346",
      "https://ik.imagekit.io/openhouse/synthesis%20web%20photos3%20-%20Jade%20Stella.png?updatedAt=1714488917087",
      "https://ik.imagekit.io/openhouse/synthesis%20web%20photos4%20-%20Jade%20Stella.png?updatedAt=1714488923527",
      "https://ik.imagekit.io/openhouse/synthesis%20web%20photos5%20-%20Jade%20Stella.png?updatedAt=1714488927428"
    ]
  },
  {
    "Name": "Jess Mayrides",
    "Instagram": "",
    "Website": "https://jess8608.myportfolio.com/",
    "Project Description": "Music has been a big part of me since I was young, and I’ve had all these thoughts \nabout what music means to people and how it affects  them. This project aims to explore the proven impacts of music on humanity/society.\nI explored four topics to connect music and humanity: humanness, psychology, place, and art.\nFor my research, I interviewed a handful of close friends about their\nexperiences with music, with questions loosely revolving around each topic. Each topic (mentioned above) had three questions each in order to gain a wide variety of answers. The interview was in person and recorded in a casual setting. All interviews were edited and compiled into one large video interspersed with recordings of concerts (both mine and others) for added musicality. \nI compiled more formal internet research and created 4 booklets broaching each topic in a dynamic and colorful way using typography and image gradients. These booklets are each placed inside a CD case with a DVD that contains each corresponding video section. The videos were available to play on a portable DVD player at the Open House exhibition, and the full video is available to watch on Youtube starting May 2nd, 2024.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/IMG_0141%20-%20Jess%20Mayrides.jpg?updatedAt=1714488899433",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Joy Lee",
    "Instagram": "https://www.instagram.com/local_art_gremlin/",
    "Website": "https://joyjialeart.wordpress.com/",
    "Project Description": "<i>Penny and the Land of Grief</i> is a children’s book that describes the five stages of grief as cities that you travel through. Grief is not a linear process, regardless of what we like to believe. You can spend a long time in anger, or bounce between depression and denial. But regardless of what “city” you’re in, the end of that journey is always going to be acceptance. I wanted to be able to provide both children and adults with the language that we sometimes find ourselves lacking when are going through hard times, such as the death of a family member, the loss of our home, or the end of a friendship. ",
    "URLs": [
      "https://ik.imagekit.io/openhouse/Penny%20and%20the%20Land%20of%20Grief%20(square%20aspect%20ratio)%20-%20Joy%20Lee.jpg?updatedAt=1714488899597",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Kien Ngo",
    "Instagram": "https://www.instagram.com/kien.wah/",
    "Website": "https://ngokt3.myportfolio.com/",
    "Project Description": "My body is my artwork, my end goal, my masterpiece. Coming to terms of how I look is loving myself. Working on myself is a form of self therapy, to clear my mind in turn allowing myself to become more creative. At the end of the day all I have is myself and so be it, my book is a photo memoir. I, I, I - this is a book about a centered obsession about myself. I am a narcissist.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/IMG_2618%20-%20Kien%20Ngo.jpeg?updatedAt=1714488899738",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Lillie Bloch",
    "Instagram": "",
    "Website": "https://lilliebloch.wixsite.com/my-portfolio",
    "Project Description": "My project focuses on obsessive-compulsive disorder and the effect it can have on one's life. Through mold imagery viewers can see how different obsessions take over and spread.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/december%20SQUARE%20-%20Lillie%20Bloch.png?updatedAt=1714488899881",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Meghan Andrews",
    "Instagram": "",
    "Website": "https://www.meghanandrewsportfolio.com/",
    "Project Description": "<i>1,000 words</i> is a website about alt text and image description, which are verbal descriptions of visual content found online. The website contains educational content, such as an “Introduction to alt text” section that defines both alt text and image description, and shows examples of what these might look like. There is also an interactive section of the website, providing the opportunity to practice writing alt text and image descriptions. Ultimately, 1,000 words is a space where one can learn, practice, and engage with alt text and image description. <a href=\"https://andrewsmr2.github.io/one-thousand-words/\">andrewsmr2.github.io/one-thousand-words/</a>",
    "URLs": [
      "https://ik.imagekit.io/openhouse/one-thousand-words-1%20-%20Meghan%20Andrews.jpg?updatedAt=1714488900313",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Shuhan Yang",
    "Instagram": "https://www.instagram.com/shuhan_arttttt?igsh=MTZxa3I5MWd4ajhocw==",
    "Website": "https://shuhansportfolio.cargo.site/",
    "Project Description": "“We shape ourselves to fit this world and we also shape the\nworld.” The inspiration for my project comes from my craft\nexperience with hammering metalwork. As a senior student\nin college, I want to record this time that we are facing the\nchanges or options after graduating. At this time, how do we\nshape ourselves to fit this new situation and what could we do\nin/for this society in the future? I see the real world as a new\nlearning environment, much like a child’s perspective. Viewing\nmyself as a child, I anticipate facing unknown challenges\nahead. Similar to how kids learn through the alphabet, I\npropose an “alphabet book” as a symbolic tool for the young\ngeneration to understand and navigate the complexities of real\nsociety.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/Shuhan_1%20-%20Shuhan%20Yang.png?updatedAt=1714488900481",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Sophie Hampton",
    "Instagram": "instagram.com/artfromsophie",
    "Website": "motherboardarchive.com",
    "Project Description": "My synthesis project focuses on the complexities of daughterhood and mother/daughter relationships. The <i>MotherBoard Archive</i> is a curated library of resources and media centered around navigating complex mother/daughter relationships, girlhood, self healing, and healing relational patterns. The digital archive functions as a gentle guide; a recipe for healing and self reflection. The MotherBoard archive can be engaged with purely as a resource library, or (by means of an interactive personality quiz function) as a way to generate a personalized list of resource and media recommendations based on the user’s specific need within this broader topic. This project is also about finding community within the complexities of these relationships. Using a handful of public engagement prompts I have also been gathering anonymous survey responses, voicemails, and text messages to help me understand where communication struggles exist within the context of mother/daughter or parent/child relationships. The user is also able to browse through a growing selection of these anonymous voicemail and text submissions. <a href=\"http://motherboardarchive.com/\">motherboardarchive.com</a>",
    "URLs": [
      "https://ik.imagekit.io/openhouse/square%20-%20Sophie%20Hampton.png?updatedAt=1714488900648",
      "https://ik.imagekit.io/openhouse/websquare%20-%20Sophie%20Hampton.png?updatedAt=1714488910561",
      "https://ik.imagekit.io/openhouse/websquare2%20-%20Sophie%20Hampton.png?updatedAt=1714488917291",
      "",
      ""
    ]
  },
  {
    "Name": "Stella Tessarollo",
    "Instagram": "https://www.linkedin.com/in/stellatessarollo/",
    "Website": "www.stellatessarollo.com",
    "Project Description": "<i>The Art of Climate Education</i> aims to use art as a catalyst for change. This book is a collection of primarily installation based artworks that seek to educate viewers on climate issues and inspire them to take action. Each piece of art was selected based on its ability to convey an important message about the need to conserve our environment. Some works use appreciation as the motivating factor, while others propose solutions to how we might tangibly make a difference in protecting our world. The goal is to invite curiosity and inspire viewers to learn in a new way. During my time in GDES, I discovered my passion for designing informational publications for climate education. This project is a culmination of my love for art, research, bookbinding, and the desire to make a small impact on the world by inspiring someone to make a positive change in their lifestyle to help protect our Earth.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/IMG_9838%20-%20Stella%20Tessarollo.jpg?updatedAt=1714488900833",
      "https://ik.imagekit.io/openhouse/IMG_9836%20-%20Stella%20Tessarollo.jpg?updatedAt=1714488910736",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Sydney Folsom",
    "Instagram": "https://www.instagram.com/sydneythestrange",
    "Website": "",
    "Project Description": "<i>Gunk</i> is an art and fashion brand that represents the strange and disturbed. As someone who identifies with the more obscure side of life, I wanted to create a project that looks like my brain threw up and I'm forcing everyone to look at it. With my experience in graphic design, fashion styling, and magazine management, Gunk encompasses all of my passions into one big project. <a href=\"https://www.instagram.com/thegunkyard\">gunkyard instagram</a>",
    "URLs": [
      "https://ik.imagekit.io/openhouse/Folsom_2x2_Left%20-%20Sydney%20Folsom.jpg?updatedAt=1714488901012",
      "https://ik.imagekit.io/openhouse/Folsom_2x2_Right%20-%20Sydney%20Folsom.jpg?updatedAt=1714488910929",
      "https://ik.imagekit.io/openhouse/Folsom_3.5x2%20-%20Sydney%20Folsom.jpg?updatedAt=1714488917525",
      "",
      ""
    ]
  },
  {
    "Name": "Yuying Shi",
    "Instagram": "",
    "Website": "",
    "Project Description": "This project creates a 2024 calendar focused on the Chinese 24 Solar Terms. Each page represents a specific solar term, showcasing associated traditional foods and cultural significance through uniquely designed icons and color schemes. This calendar is not only a record of time but also a modern interpretation and visual presentation of traditional Chinese solar term culture. Printed in color, each icon is rich in detail and vibrant in hues, designed to engage users in exploring the culinary customs and cultural depth behind each solar term. The calendar serves both practical daily use and as an educational and cultural dissemination tool, enhancing understanding and interest in traditional solar term knowledge.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/mokeup1%20-%20Yuying%20Shi.png?updatedAt=1714488901153",
      "https://ik.imagekit.io/openhouse/Mockup2%20-%20Yuying%20Shi.png?updatedAt=1714488911086",
      "https://ik.imagekit.io/openhouse/mokeup3%20-%20Yuying%20Shi.png?updatedAt=1714488917662",
      "https://ik.imagekit.io/openhouse/%E4%B9%A6%E7%AD%BE_catalog%20-%20Yuying%20Shi.png?updatedAt=1714488923745",
      ""
    ]
  },
  {
    "Name": "Jasmine Knight",
    "Instagram": "",
    "Website": "",
    "Project Description": "<i>Cocoa & Berry: An Exploration of Brand Design</i> is a project I have wanted to do for a long time; it combines all the things I love about graphic design! Cocoa & Berry came to life via my love for hot chocolate. I wanted to create a brand that I would seriously buy from. The brand is a mix of bright, cute, elegant, and simple. I chose to host the majority of the brand content on a website. On this site alongside the beverage itself, there is some other merchandise that has been designed such as totes, stickers, and pins. \n\nThe brand itself was designed after various aspects of a hot chocolate and berry fusion. The main logo is decorative and includes elements that mimic things such as the swirl of whipped cream or a cherry that tops off the warm drink. This is a recurring theme throughout the brand.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/1%20-%20Jasmine%20Knight.png?updatedAt=1714488901313",
      "https://ik.imagekit.io/openhouse/4%20-%20Jasmine%20Knight.png?updatedAt=1714488911280",
      "https://ik.imagekit.io/openhouse/2%20-%20Jasmine%20Knight.png?updatedAt=1714488917866",
      "https://ik.imagekit.io/openhouse/3%20-%20Jasmine%20Knight.png?updatedAt=1714488923931",
      "https://ik.imagekit.io/openhouse/5%20-%20Jasmine%20Knight.png?updatedAt=1714488927652"
    ]
  },
  {
    "Name": "Lillie Jean",
    "Instagram": "https://www.instagram.com/50ftjeanie/",
    "Website": "https://lilliejean.cargo.site/",
    "Project Description": "This is a piece for me & pieces of me, that I share with you:\n\nA collection of stories and objects that have belonged to past relatives of mine; I mostly follow female lines on both maternal and paternal sides. All four of my grandparents have passed, but I did know them. My grandmothers have always held my heart warmly, and although they are gone, that warmth has never left. \n\nMy Mom is an only girl with two brothers, and my Dad has three brothers and one sister, my only aunt. I don't have any sisters either. The three of us have been put in charge of keeping these belongings and stories safe. Now, I take the opportunity to showcase these well-preserved pieces and give some backstory to my lengthy and dense inheritances. This is only chipping the surface of what I have. \n\nTo me, these are rich in personal value and memory. Also... yes...they are cool to look at.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/F7B2D970-DEB5-40EA-AC66-76FCDF545FA8_1_201_a%20-%20Lillie%20Fucile.jpeg?updatedAt=1714488901476",
      "https://ik.imagekit.io/openhouse/A16CA39C-9A16-4C6A-AE44-18175B8F20C8_1_201_a%20-%20Lillie%20Fucile.jpeg?updatedAt=1714488911420",
      "https://ik.imagekit.io/openhouse/2D943CF9-04DF-4991-9B3A-AA0C8B54C2CD_1_201_a%20-%20Lillie%20Fucile.jpeg?updatedAt=1714488918010",
      "https://ik.imagekit.io/openhouse/84B416E4-94B6-4E14-86C3-A2D6AEA452E3_1_201_a%20-%20Lillie%20Fucile.jpeg?updatedAt=1714488924080",
      ""
    ]
  },
  {
    "Name": "Lesly Melendez ",
    "Instagram": "https://www.instagram.com/sockconnoisseur/",
    "Website": "https://leslymelendez.com/",
    "Project Description": "I created a series of publications under a brand called\n<i>Melon Magazine</i> that speak upon my experiences of what it\nmeans to be hispanic from my personal perspective through\nbookmaking, storytelling, and multimedia experimentation.\nThis series is meant to share my story and perspective on what\nit's like to be a Salvadorian woman that has never really felt\nconnected to my own culture. Through these books you will\nfollow along my journey on how I found my way back to myself\nand the wonderful people that have guided me along the way.\nWe will laugh, we will cry, and at times we will cringe, but its all\nlove over here!",
    "URLs": [
      "https://ik.imagekit.io/openhouse/melonmag1%20-%20Lesly%20Melendez.jpg?updatedAt=1714488901646",
      "https://ik.imagekit.io/openhouse/melonmag2%20-%20Lesly%20Melendez.jpg?updatedAt=1714488911613",
      "https://ik.imagekit.io/openhouse/melonmag3%20-%20Lesly%20Melendez.jpg?updatedAt=1714488918164",
      "",
      ""
    ]
  },
  {
    "Name": "Ann Emilie Ganao",
    "Instagram": "https://www.instagram.com/annwithanartplan",
    "Website": "https://ganaoae84c4.myportfolio.com",
    "Project Description": "\nIn <i>NKOSO</i>, I invite you into the sacred pages of my cultural journal—a poetic odyssey through the soul of my Congolese heritage and the intimate corners of my being. Each stroke of design whispers tales of my ancestry, and each color palette echoes the hues of my identity.\n\nThrough ink and pixels, I weave a tapestry of tradition and personal narrative—a mosaic of ancient rhythms and modern musings. Bold typography dances with the spirits of my forebears, while vibrant colors sing the songs of my heart.\n\nIn this visual memoir, I lay bare the contours of my truth—the echoes of my past, the dreams of my future. NKOSO is not merely a project; it's a voyage—a whispered invitation to explore the depths of my soul and the richness of my culture, one brushstroke at a time.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/IMG_0910%20-%20Ann%20Ganao.jpeg?updatedAt=1714488901796",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "ziggy",
    "Instagram": "https://www.instagram.com/lethernews/?hl=en",
    "Website": "https://lethernews.com/",
    "Project Description": "<a href=\"https://lethernews.com/\">lethernews.com</a> is a commentary on anonymity, online spaces and aliases. ziggy releases a new article every week that is relatable and entertaining to her readers. she creates a space in let her news where people can be comfortable interacting with her content due to being anonymous, sharing similarities in advice columns in other publications. the voice she has created in her writing mimics a casual text conversation with a close friend — creating a relaxed, friendly environment. her tone is cool and casual. the print publication that she has published includes her most liked articles along with a few changes to surprise her active subscribers. ",
    "URLs": [
      "https://ik.imagekit.io/openhouse/IMG_9324%20-%20Solimar%20Santoyo.jpg?updatedAt=1714488901978",
      "https://ik.imagekit.io/openhouse/IMG_9330%20-%20Solimar%20Santoyo.jpg?updatedAt=1714488911808",
      "https://ik.imagekit.io/openhouse/IMG_9335%20-%20Solimar%20Santoyo.jpg?updatedAt=1714488918363",
      "https://ik.imagekit.io/openhouse/lhn_formfile2%20-%20Solimar%20Santoyo.jpg?updatedAt=1714488924265",
      ""
    ]
  },
  {
    "Name": "Suzie Han",
    "Instagram": "https://www.instagram.com/szh_09/?utm_source=qr",
    "Website": "https://hans12.myportfolio.com/",
    "Project Description": "For my project,<i>Emotional Mindspaces</i>, I aim for readers to navigate a journey through the mindset we have during emotional stress or heightened emotion. In my first book, I include images and writing that reflect my perspective when grappling with depression. It feels as if I am in a dark pit and everything around me is grey. In my second book, I talk about my experience with anxiety and how it restricts my ability to act freely. Each book is printed on cardstock with clear acrylic covers and bounded with a Coptic stitch. The covers are clear because they symbolize my feelings in a glass box. With this project, I strive for transparency about my feelings and as much as I want to hide them, they are on display for all to see. ",
    "URLs": [
      "https://ik.imagekit.io/openhouse/1%20-%20Suzie%20Han.png?updatedAt=1714488902182",
      "https://ik.imagekit.io/openhouse/2%20-%20Suzie%20Han.png?updatedAt=1714488911966",
      "https://ik.imagekit.io/openhouse/3%20-%20Suzie%20Han.png?updatedAt=1714488918581",
      "https://ik.imagekit.io/openhouse/4%20-%20Suzie%20Han.png?updatedAt=1714488924453",
      ""
    ]
  },
  {
    "Name": "Abbi Bennett",
    "Instagram": "https://www.instagram.com/abbixdesigns?igsh=MW12cWVuN3p5NmNleQ==",
    "Website": "https://abbibennett.cargo.site/",
    "Project Description": "<i>Transitional Release</i> is the name of an exhibition showcasing paintings by Amina Coleman-Davis. Working as a curator and designer of this exhibition, I came up with the entire identity for the exhibition. The bright and exciting colors present in the designs are a direct reflection of the colors used in her paintings. Amina uses her practice as a way to grieve and remember her ancestors claiming that death is a “transitional release,” and is something that should be celebrated. The collection of paintings present in the exhibition is called “Scribbled with Love,” thus the scribbledness of the identity. I was intrigued by her bush strokes and the flow of her work, picking out specific strokes that stood out specifically for the identity. As well as designing the main logo and design of the exhibition, I have also created several other designs that would be present at the opening such as tickets and postcards.Creating this exhibition identity has given me the opportunity to view death in a new way, while also learning how to properly exhibit someone else’s work in a way that does it justice. ",
    "URLs": [
      "https://ik.imagekit.io/openhouse/Web%20pics%20-%20Abbi%20Bennett.jpg?updatedAt=1714488902354",
      "https://ik.imagekit.io/openhouse/Web%20pics2%20-%20Abbi%20Bennett.jpg?updatedAt=1714488912155",
      "https://ik.imagekit.io/openhouse/Web%20pics3%20-%20Abbi%20Bennett.jpg?updatedAt=1714488918747",
      "https://ik.imagekit.io/openhouse/Web%20pics4%20-%20Abbi%20Bennett.jpg?updatedAt=1714488924711",
      ""
    ]
  },
  {
    "Name": "Anna Barnes",
    "Instagram": "https://www.instagram.com/annanymous.png",
    "Website": "",
    "Project Description": "The tattoo industry is notoriously exclusive and male-dominated. This leaves a difficult road for BIPOC, queer, trans, disabled, and femme people to find welcoming spaces within the tattoo community. Many of these marginalized groups have already paved their own way within the industry, and are working to open up spaces and opportunities for others. However, these coveted safe spaces to learn and get tattooed can still be challenging to find and access. My biggest hope with this project was to create a resource that could help those interested and searching for these spaces to find them, and demystify the process of learning and becoming a tattoo artist. This is only the first edition of many to come, as there is more that I have to learn and want to share. Here’s to safe and inclusive tattoo experiences of all kinds!",
    "URLs": [
      "https://ik.imagekit.io/openhouse/web2%20-%20Anna%20Barnes.jpg?updatedAt=1714488902516",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Gigi Pham Ton",
    "Instagram": "",
    "Website": "",
    "Project Description": "<i>Production</i> is a visual exploration examining the utility of (graphic) design. This project investigates the various principles of modern design creation. \n\nMy approach to this exploration manifests into a self reflection - how I've encountered these concepts throughout my own creative journey. The poster serves as an illustrative map, compiled with compositions that represent production principles. Through an accompanying publication, the poster is dissected, providing visual and informational context. These pieces collectively form my introspective reflection on design production.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/documentation1%20-%20Gigi%20Pham-Ton.png?updatedAt=1714488902680",
      "https://ik.imagekit.io/openhouse/documentation2%20-%20Gigi%20Pham-Ton.png?updatedAt=1714488912310",
      "https://ik.imagekit.io/openhouse/documentation3%20-%20Gigi%20Pham-Ton.png?updatedAt=1714488918944",
      "https://ik.imagekit.io/openhouse/documentation4%20-%20Gigi%20Pham-Ton.png?updatedAt=1714488924874",
      ""
    ]
  },
  {
    "Name": "Wendy Nguyen",
    "Instagram": "",
    "Website": "",
    "Project Description": "It was a lovely coincidence that my brother just so happened to be getting married in Vietnam at the same time I was conjuring up how I was going to go about what I wanted to do. I took the opportunity with the two weeks I had earlier in the year to observe and capture everything I possibly could that could fuel my inspiration while in Vietnam: textures, building structures, street signs, the flowers and plants; anything I could lay my eyes on, I wanted to capture. \nWith all of this, I took all of my observations and began a rebrand campaign for my mom’s small business nail salon by bringing Vietnamese elements and aesthetics into modern brand design including a new logo, business cards, service menus, and a revival of a vintage form of advertisement in a paper fan. I am bringing these Vietnamese elements to my home in the United States by means of the design branding, and I am simultaneously bringing bits and pieces of my mom’s home here into the salon. This project exists a “thank you” to her.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/card%20mockup%20square%20-%20Wendy%20Nguyen.jpg?updatedAt=1714488902847",
      "https://ik.imagekit.io/openhouse/fan%20-%20Wendy%20Nguyen.jpg?updatedAt=1714488912456",
      "https://ik.imagekit.io/openhouse/mockup%20layout-02%20-%20Wendy%20Nguyen.jpg?updatedAt=1714488919098",
      "",
      ""
    ]
  },
  {
    "Name": "Jenna Kareliussen",
    "Instagram": "https://www.instagram.com/jkareli19?igsh=MXVyeGJrM2NlZmxkdA%3D%3D&utm_source=qr",
    "Website": "jkareliussen.myportfolio.com",
    "Project Description": "<i>Masking Reality</i> presents a series of multimedia masks that examine the role of surrealism in identity and liberation. Each element in the work serves a distinct purpose: the delicate intricacies of yarn and embroidery symbolize the interconnectedness of the human experience, while the malleable nature of clay and wire represents the fluidity of self. Together, these elements draw from my own experiences navigating the complexities and inner turmoil inherent in my journey toward self-discovery. ",
    "URLs": [
      "https://ik.imagekit.io/openhouse/IMG_8774%20-%20Jenna%20Kareliussen.jpeg?updatedAt=1714488902992",
      "https://ik.imagekit.io/openhouse/IMG_8773%20-%20Jenna%20Kareliussen.jpeg?updatedAt=1714488912582",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Ella Provo ",
    "Instagram": "https://www.instagram.com/plasticcapricot/",
    "Website": "",
    "Project Description": "From November 2023 to April 2024, I gathered my friends in my apartment in Richmond Virginia to hold a dinner party every two weeks. This original group was asked to make invitations and bring in new guests with an interest in craft. As the event grew, it changed, and each dinner became a new iteration in the series. Dinners centered community, performance, food, making, and the possibilities that opened up to us when we were all gathered in one place. I want to hold so much space for the people I care about to be joyful and queer and I hope to show others how expansive their communities can be.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/IMG_2729%20-%20Ella%20Provo.jpeg?updatedAt=1714488903147",
      "https://ik.imagekit.io/openhouse/IMG_2637%20-%20Ella%20Provo.jpeg?updatedAt=1714488912785",
      "https://ik.imagekit.io/openhouse/IMG_2632%20-%20Ella%20Provo.jpeg?updatedAt=1714488919237",
      "",
      ""
    ]
  },
  {
    "Name": "Vy Doan",
    "Instagram": "",
    "Website": "",
    "Project Description": "<i>Viva Ca Phe</i> celebrates Vietnamese coffee culture through artistically designed packaging and an informative booklet that guides enthusiasts on creating authentic Vietnamese brews. This project highlights unique aspects of Vietnamese coffee, such as robusta beans and the traditional drip brew, and integrates them with elements of traditional Vietnamese art. In addition, I have designed a distinct Vietnamese coffee brand to honor and share Vietnam's rich coffee heritage with a global audience, making it accessible through educational insights and captivating designs. Viva Ca Phe seeks to bridge cultures, inviting the world to explore the depth and tradition of Vietnamese coffee.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/website%20-%20Vy%20Doan.png?updatedAt=1714488903330",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Hannah Robinson",
    "Instagram": "https://www.instagram.com/hamahrob/",
    "Website": "",
    "Project Description": "In <i>I Hate It Here</i>, I examine the transition from print to digital news media. Previously, newspapers dominated, printed overnight for mass consumption. Now, the internet offers limitless resources and instant news dissemination. I explore the pros and cons: the freedom from printed newspapers versus the mental health toll, misinformation, and other unforeseen consequences. Rooted in personal experience, this project challenges assumptions about the internet's role in our lives, inviting readers to reflect on the complexities of our digital age.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/edited-59%20-%20Hannah%20Robinson.jpg?updatedAt=1714488903566",
      "https://ik.imagekit.io/openhouse/edited-94%20-%20Hannah%20Robinson.jpg?updatedAt=1714488912934",
      "https://ik.imagekit.io/openhouse/edited-93%20-%20Hannah%20Robinson.jpg?updatedAt=1714488919401",
      "https://ik.imagekit.io/openhouse/edited-95%20-%20Hannah%20Robinson.jpg?updatedAt=1714488925070",
      "https://ik.imagekit.io/openhouse/edited-96%20-%20Hannah%20Robinson.jpg?updatedAt=1714488927917"
    ]
  },
  {
    "Name": "Jood Farkouh",
    "Instagram": "https://www.instagram.com/jood.gif/",
    "Website": "",
    "Project Description": "Mosaics and traditional Arabic embroidery have many similarities, both meticulous labors of love. Each stitch a tile; a piece of a larger whole. A single tessera or a cross-stitch on its own is beautiful in its simplicity, but add one more, then another, and another, and soon a narrative is born. But the effort behind these individually laid tiles/made stitches often go unnoticed in the places they live and the purposes they serve. Thus, I combined these two art forms by creating an embroidered mosaic of decorative ornamental patterns and designs. Whether the time and work put into this piece will go unnoticed remains to be seen.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/Jood%20square%20image%20-%20Jood%20Farkouh.jpg?updatedAt=1714488903817",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Natalie Kerby",
    "Instagram": "https://www.instagram.com/nataliekerbyart",
    "Website": "https://kerbykat0.wixsite.com/natalie-kerby",
    "Project Description": "I have a great love for album art and creating work that interacts with music. Over the past few months, I collaborated with musicians of different genres to create three album artworks to build my portfolio. <i>Ride or Die or Both</i> is an album by Son of Soong, an artist heavily inspired by Star Trek and astronomy. For the album art, I created an illustration of Data’s face and the hand of Noonian Soong to reference the artist’s name directly (Data is an android created by Soong). <i>Moire</i> by Malaphor is an album currently in the making. It is an experimental album mixing different genres and sounds in a style reminiscent of Amon Tobin, Aphex Twin, Drumcorps, and Igorrr, among others. For the album art, I created a digital moire pattern with overlapping circles and vertical and horizontal lines with colors that relate to the musician’s aesthetic. <i>Dungeonscapes Vol. 2</i> by SNGN is part of an ongoing series of ambient albums meant for tabletop RPGs. I had created the album art for Dungeonscapes Vol. 1 back in 2020. For Dungeonscapes Vol. 2, I continued with a traditional painting to maintain the same aesthetic.\n",
    "URLs": [
      "https://ik.imagekit.io/openhouse/ds2%20final%20with%20text%20-%20Natalie%20Kerby.jpg?updatedAt=1714488903966",
      "https://ik.imagekit.io/openhouse/malaphor%20mauve%20-%20Natalie%20Kerby.jpg?updatedAt=1714488913093",
      "https://ik.imagekit.io/openhouse/ssswtexture3%20-%20Natalie%20Kerby.jpg?updatedAt=1714488919715",
      "https://ik.imagekit.io/openhouse/dungeonscapesedit%20-%20Natalie%20Kerby.jpg?updatedAt=1714488925239",
      ""
    ]
  },
  {
    "Name": "sky ahmed",
    "Instagram": "",
    "Website": "",
    "Project Description": "With a vision to blur the boundaries between art and fashion, I embarked on a journey to create a captivating collection of 3D printed jewelry and accessories. The collection is titled <i>NEPTUNE</i>. The designs of my pieces draw inspiration from the ocean and its inhabitants, ranging from little critters in tidepools to the darkest abyssal trenches. Here, fish withstand the unholy water pressure while illuminating disarming bioluminescent beauty. All of the pieces are resin printed and 3D modeled using Blender and Nomad Sculpt. The pieces in the collection range from fluidic printed eyewear to spinning rings. I wanted each piece to exude avant-garde charm and feel like wearable art on the body. The colors used vary from shimmering silver reminiscent of moonlight on a watery horizon to shapeshifting hues of coral in one piece, changing color depending on the angle of the light, thus creating an enchanting play of color and shadow. Through the fusion of cutting-edge technology and timeless design, my aim is to create not just accessories, but artifacts that inspire wonder and curiosity and push the boundaries of fashion and art.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/Screenshot%202024-04-26%20at%208.34.27%E2%80%AFPM%20-%20Saleh%20Almahmeed.png?updatedAt=1714488904132",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Jangmi Paik",
    "Instagram": "https://www.instagram.com/esor_001/",
    "Website": "jangmipaik.com",
    "Project Description": "Ever since I moved to a different country, memories of Korea have become more special, forming the core of my identity. I believe stone lithography has a strong correlation to memory and pearls. Oysters build layers on top of an irritant, using it as a nucleus, much like people build distorted layers on top of the original memory that fades. Stone lithography involves a significant amount of irritation of the surface and layers of grease that forms the image. The series of prints, using my childhood home and lithography as the core, build layers on top of each other, combining them into the theme of memories and nostalgia.\n\nI am also interested in the process of digital degradation. In a similar way to how digital copies are made and circulated, memories can be linked to copies of experiences stored in our minds. Each time we recall a memory, it may degrade and become distorted, influenced by factors such as personal biases, emotions, and subsequent experiences. Just as digital images lose quality with each copy, memories may lose fidelity and accuracy over time. This creates room for imagination, and I believe the distorted layers of memories are what make nostalgia special. I aimed to visualize this idea in a format of digital web: <a href=\"https://nostalgia.city/\">nostalgia.city.</a>",
    "URLs": [
      "https://ik.imagekit.io/openhouse/nostalgia%20-%20Jangmi%20Paik.jpg?updatedAt=1714488904346",
      "https://ik.imagekit.io/openhouse/seoul%20-%20Jangmi%20Paik.jpg?updatedAt=1714488913281",
      "https://ik.imagekit.io/openhouse/night%20drive%20-%20Jangmi%20Paik.jpg?updatedAt=1714488919894",
      "https://ik.imagekit.io/openhouse/memory%20and%20nostalgia%20-%20Jangmi%20Paik.jpg?updatedAt=1714488925409",
      "https://ik.imagekit.io/openhouse/performance%20art1%20-%20Jangmi%20Paik.jpg?updatedAt=1714488928143"
    ]
  },
  {
    "Name": "Sydney Evertsen",
    "Instagram": "",
    "Website": "https://sydneyevertsendesign.myportfolio.com",
    "Project Description": "<i>Mourning Lens</i> is a large scale (4x8 ft.) mausoleum structure representative of a bereavement hallucination, which is when you experience the presence of a loved one after their passing. This project is meant to be not only a symbol of my own grief and how I have processed it for the last 15+ years, but also a way to memorialize my father and our relationship. The materials employed, such as the lenticular print, scent elements, and the imposing nature of the structure itself, are meant to make the viewer feel as though they are in the presence of a loved one, more specifically my father. The lenticular prints, which through the use of multiple images and a specific lens make a 2D surface appear 3D, are 2 images composed of a total of 16 different kaleidoscopic collages made from images of me and my father from my early childhood. Website: https://sydneyevertsendesign.myportfolio.com",
    "URLs": [
      "https://ik.imagekit.io/openhouse/Sydney%20Evertsen%20web%20documentation%20-%20Sydney%20Evertsen.jpg?updatedAt=1714488904536",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Chia Yang",
    "Instagram": "https://www.instagram.com/chiayang6/?hl=en",
    "Website": "",
    "Project Description": "<i>The Kinmen Islands</i> is inspired by my grandparents and mother's hometown. During the COVID-19 pandemic, I lived in the Kinmen Islands for over half a year. I captured the island's architecture, landscape, and nature through my lens. A physical photographic archive felt like the most suitable way to introduce the island's rich history and culture to people\nwho may have never heard of its existence. I want to showcase the beauty of rural land through my imagery. I dedicate this work to my grandfather, the most hard-working\nperson I've ever known.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/Documentation%20File%20%231%20-%20Chia%20Yang.jpg?updatedAt=1714488904743",
      "https://ik.imagekit.io/openhouse/Documentation%20File%20%232%20-%20Chia%20Yang.jpg?updatedAt=1714488913484",
      "https://ik.imagekit.io/openhouse/Documentation%20File%20%233%20-%20Chia%20Yang.jpg?updatedAt=1714488920109",
      "https://ik.imagekit.io/openhouse/Documentation%20File%20%234%20-%20Chia%20Yang.jpg?updatedAt=1714488925582",
      "https://ik.imagekit.io/openhouse/Documentation%20File%20%235%20-%20Chia%20Yang.jpg?updatedAt=1714488928387"
    ]
  },
  {
    "Name": "David Reyes",
    "Instagram": "instagram.com/krone_2024",
    "Website": "reyesddb415.myportfolio.com",
    "Project Description": "The idea of the <i>Krōnē</i> began a few years ago as a creative hobby with no projected direction. Throughout my time at VCU, I developed iterations until I concluded that I was going to use my finalized character design for the foundation of my capstone project. I taught myself enough digital 3D modeling to recreate my design, exported the finished design to be 3D printed, then created a physical Krōnē head. A silicon mold was created to quickly cast resin copies, and these have been painted and hid around campus for anyone to find and take home. There have been 10 blank smaller heads placed around every week for the last month as “DIY toys” to paint or color, in hopes to create an engaging community around an art toy posing as a blank canvas.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/Basic%20Buddy%20-%20David%20Reyes.jpg?updatedAt=1714488904922",
      "https://ik.imagekit.io/openhouse/Lava%20Demon_Krone%20-%20David%20Reyes.jpg?updatedAt=1714488913651",
      "https://ik.imagekit.io/openhouse/Abominable%20Snow_Krone%20-%20David%20Reyes.jpg?updatedAt=1714488920304",
      "https://ik.imagekit.io/openhouse/Blueprint_Krone%20-%20David%20Reyes.jpg?updatedAt=1714488925747",
      "https://ik.imagekit.io/openhouse/Paper%20Bag_Krone%20-%20David%20Reyes.jpg?updatedAt=1714488928575"
    ]
  },
  {
    "Name": "Brinnaria Schmiedicke",
    "Instagram": "https://www.instagram.com/makinstuffmaybe?igsh=MW4zemV3YmRmMWQ4cQ%3D%3D&utm_source=qr",
    "Website": "",
    "Project Description": "A life-sized paper sculpture that serves as a journal for reflecting on the bittersweet change that accompanies growing up and the loss of the simplicity and simple joy of childhood. The journal reflects themes of fragmented modernity and intrinsic human needs. It is written in a font called POLSKA designed specifically for this project and features a poem written by Michael Schmiedicke, as well as musing thereupon by the artist. The process of writing and creating this paper woman serves as a mourning ritual for the artist, akin to ancient tradition of mourning rituals held by the artist’s Polish and German ancestors. The purpose of this piece is to hold space for the complicated feelings that accompany change and then in it’s completion, leave those feeling in peace. ",
    "URLs": [
      "https://ik.imagekit.io/openhouse/Untitled%20-%20December%202%2C%202023%2005.12.58%20-%20Brinnaria%20Schmiedicke.jpeg?updatedAt=1714488905181",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Reagan Young",
    "Instagram": "https://www.instagram.com/re.y_yy/",
    "Website": "",
    "Project Description": "<i>The Play Project</i> investigates themes of poetry, introspection, and joyfulness by borrowing from familiar game-like structures to facilitate art-making. It observes the poetics of subjectivity and individuality, emphasizing that there is no right answer, and no two forms of play are the same. ",
    "URLs": [
      "https://ik.imagekit.io/openhouse/3%20-%20Reagan%20Young.png?updatedAt=1714488905400",
      "https://ik.imagekit.io/openhouse/2%20-%20Reagan%20Young.png?updatedAt=1714488913859",
      "https://ik.imagekit.io/openhouse/1%20-%20Reagan%20Young.png?updatedAt=1714488920486",
      "",
      ""
    ]
  },
  {
    "Name": "Mac Woolley",
    "Instagram": "",
    "Website": "",
    "Project Description": "<i>For Ever For Real</i> is a movie I have been making over the past few months. It is about the desire for scientific everlasting life on earth. Eternal life has traditionally been sought after through religious promises of the after life, but now we can use science to achieve that goal. The movie uses this as the backdrop for more specific performances of health obsession. ",
    "URLs": [
      "https://ik.imagekit.io/openhouse/woolleymacdocumentation%20-%20Michael%20Woolley.png?updatedAt=1714488905587",
      "https://ik.imagekit.io/openhouse/woolleytwo%20-%20Michael%20Woolley.png?updatedAt=1714488914039",
      "https://ik.imagekit.io/openhouse/woolley3%20-%20Michael%20Woolley.png?updatedAt=1714488920677",
      "",
      ""
    ]
  },
  {
    "Name": "Jackayla Pendergast ",
    "Instagram": "",
    "Website": "https://thepen.myportfolio.com/",
    "Project Description": "With so many passions available, it is difficult to fit them all into one career when joining the workforce. Expanding our mindset beyond a singular job title is not only beneficial but necessary as AI begins to reduce the value of formal hard skills. Think beyond a career and focus on the core aspects that we enjoy when working. The BE PASSIONATE campaign advocates for this mindset shift by helping young individuals learn how to input their soft skills and trait adjectives into their resume. This widens career opportunities and leads to fulfilling employment that connects to who they naturally are. Focus on why the passion makes you passionate and share that with the world. BE PASSIONATE! \n",
    "URLs": [
      "https://ik.imagekit.io/openhouse/P1%20-%20Jackayla%20Pendergast.png?updatedAt=1714488905790",
      "https://ik.imagekit.io/openhouse/P2%20-%20Jackayla%20Pendergast.png?updatedAt=1714488914207",
      "https://ik.imagekit.io/openhouse/STICKER2%20-%20Jackayla%20Pendergast.jpg?updatedAt=1714488920854",
      "https://ik.imagekit.io/openhouse/Left.Image%20-%20Jackayla%20Pendergast.png?updatedAt=1714488925931",
      ""
    ]
  },
  {
    "Name": "aaron thompson",
    "Instagram": "https://www.instagram.com/cassoblue/",
    "Website": "",
    "Project Description": "<i>Shoulder to Shoulder</i> is an impactful sculptural installation that deeply probes the essence of solidarity, self-sacrifice, and oppression within the context of protest. It profoundly reflects the collective spirit of resistance and the incredible power of unity against systemic injustices. Central to this installation is the use of burlap and mannequins, each chosen for their symbolic resonance and integral role in conveying the themes of human resilience, the flammability of change, and the faceless universality of the struggle for rights and recognition.\n\nBurlap, with its coarse texture and simple, unassuming presence, is the primary material in this sculpture, draped over mannequins to represent the masses standing in solidarity. This choice of fabric is pivotal, not only for its aesthetic and tactile qualities but for its symbolic weight. Burlap embodies the rugged endurance of the collective will, signifying the grassroots nature of social movements and the interconnectedness of individuals fighting for a common cause. It speaks to the strength found in unity and the rough-hewn, diverse fabric of society coming together to face systemic challenges.\n",
    "URLs": [
      "https://ik.imagekit.io/openhouse/documentation%20-%20Aaron%20Thompson.jpeg?updatedAt=1714488905973",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Brandon Farmer",
    "Instagram": "https://www.instagram.com/brandonshockie?igsh=MWEwNHZyYXNzcDR6OQ==",
    "Website": "",
    "Project Description": "For my project I’m doing a movie which is almost 2 hours long and I’m adding my very own merchandise as well and I will also be including links for my ads, animations movies and tv shows, websites, also be having books and a QR code to my music album. Also wooden materials as well. ",
    "URLs": [
      "https://ik.imagekit.io/openhouse/IMG_1369%20-%20Brandon%20Farmer.jpeg?updatedAt=1714488906139",
      "https://ik.imagekit.io/openhouse/IMG_0789%20-%20Brandon%20Farmer.jpeg?updatedAt=1714488914359",
      "https://ik.imagekit.io/openhouse/IMG_1653%20-%20Brandon%20Farmer.jpeg?updatedAt=1714488920974",
      "https://ik.imagekit.io/openhouse/CC0BD9D7-92DB-43B5-8C06-C2FD8AA44557%20-%20Brandon%20Farmer.jpeg?updatedAt=1714488926097",
      "https://ik.imagekit.io/openhouse/1029CCD7-425C-4BED-A98B-125237A9E275%20-%20Brandon%20Farmer.jpeg?updatedAt=1714488928772"
    ]
  },
  {
    "Name": "Colby Clarke",
    "Instagram": "",
    "Website": "number2design.com",
    "Project Description": "My pieces satirize how graphic designers don't like when people change existing structures, in this case apparel, that have been already perfected, according to them. I decided to turn apparel design on its head by taking the essence of popular articles of apparel and swapping them with another one to create new mashed-up clothing, or \"swapparel.\" The designs themselves are poking fun at the tiny white behind-the-neck tags filled with an overload of information which are so much of a nuisance that they are often cut out. To challenge that, I made them the center of attention so that there is no way to ignore or remove them. The Hoodie Hat makes fun of the materials list and the odd things they are forced to disclose about what the clothing is made of. The Mug Hoodie mocks the laundry list of required steps and tips for cleaning your clothes and their accompanying cryptic symbols. The Shirt Pants tease the unregulated sizing charts and how they can often be unreliable.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/Colby%20Clarke%20Documentation%20-%20Colby%20Clarke.jpg?updatedAt=1714488906320",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Anders Jensen",
    "Instagram": "https://www.instagram.com/anders.oj/",
    "Website": "https://anders-makes.com/",
    "Project Description": "<i>slowing… slowing… slowing…</i> slowing is the hand; slowing is transparency; slowing is personal; slowing is caring; slowing is natural; slowing is generative; slowing is a reduction; slowing is human. The infinite and exponential growth proposed by capitalist systems inherently prioritizes speed and mass production, eliminating human aspects within the labor structure. In looking at the individual as a part of the whole, the larger structure can be looked at as a machine, minimizing individual impact and sense of self. In my own angst about my place within society as a designer, visualizing a means to work against the system manifests itself in material and processes. Inducing decay onto the material itself, is an act of bringing the steel back towards nature, fighting from the embodiment of massive, monolithic systems in place. \nA companion website located at <a href=\"https://anders-makes.com/slowing.html\">anders-makes.com/slowing</a> presents a form of ‘rust’, induced by user interaction, developing over time in a digital environment. The web space acts as its own container for digital processes. In an exercise of material and process, this project is an exploration that is not meant to provide answers, but rather introduce questions and promote dialogue for alternative existences.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/andersWebsite1%20-%20Anders%20Jensen.png?updatedAt=1714488906502",
      "https://ik.imagekit.io/openhouse/andersWebsite2%20-%20Anders%20Jensen.png?updatedAt=1714488914550",
      "https://ik.imagekit.io/openhouse/andersWebsite3%20-%20Anders%20Jensen.png?updatedAt=1714488921162",
      "",
      ""
    ]
  },
  {
    "Name": "Jonah Shoval",
    "Instagram": "",
    "Website": "jonahshoval.com",
    "Project Description": "I don't want to use clothes as a canvas to create a brand but as a way to immortalize pieces of my past work that are important to me. In doing so, I am making a Forever Canvas. Over the past four years, most of my work has been posters, which I feel have a defined life span. Usually, posters wind up forgotten once the advertising period or project is over, indicating the end of the posters' lifetime. By using clothing as a medium for design, I can create things that are more meaningful to me and will have a more extended life than any poster could.\n",
    "URLs": [
      "https://ik.imagekit.io/openhouse/IMG_4703%20-%20Jonah%20Shoval.jpeg?updatedAt=1714488906678",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "liza chaplin",
    "Instagram": "https://www.instagram.com/liza_chaplin?igsh=d3JnaWs1d3k4ZHJt&utm_source=qr",
    "Website": "",
    "Project Description": "<i>Raw Material</i> is an archival diary that serves as a  testament to the importance of note taking and the preservation of process work. The book is a collection of notes, sketches, and other materials that inspire my design practice. In essence, it's an exploration into archiving and preserving concepts. Over the last few years, I've gathered bits and pieces of my life, insights gained, and thoughts pondered. These fragments, though seemingly scattered, form the essence of my growth and exploration during this transformative period. Here, I delve into the importance of exploratory work and evolving concepts, capturing the art of process work and unfinished thoughts. In a digital age, the archival diary stands as a beacon of permanence, and a sanctuary for unfinished thoughts to evolve and grow. ",
    "URLs": [
      "https://ik.imagekit.io/openhouse/lizatemplate2v2%20-%20Liza%20Chaplin.png?updatedAt=1714488906869",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Roberto Vazquez",
    "Instagram": "",
    "Website": "",
    "Project Description": "<i>TWOTHOUSAND RECORDS</i> is a speculative record label that revolves around the idea that music should be enjoyed, not made for a profit. The label has non-exclusively signed 8 different artists of different sounds and genres, with no contracts or expectations, so our artists can create and inspire to their heart’s content. TWOTHOUSAND RECORDS has also teamed up with the Working Artist Union to ensure that all rights to work created for our record label stay with the artist as well as revenues earned, leaving no room for any unfair treatment.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/1242%20-%20Roberto%20Vazquez.png?updatedAt=1714488907013",
      "https://ik.imagekit.io/openhouse/2312%20-%20Roberto%20Vazquez.png?updatedAt=1714488914704",
      "https://ik.imagekit.io/openhouse/643%20-%20Roberto%20Vazquez.png?updatedAt=1714488921386",
      "",
      ""
    ]
  },
  {
    "Name": "angie fabien",
    "Instagram": "https://www.instagram.com/totallyangiee?igsh=dTc3Zjh5OXBnYnJm",
    "Website": "https://www.instagram.com/totallynotangie_art?igsh=bjBwcDhxN2Zzc2lu",
    "Project Description": "a book with illustrations divided into three small chapters telling the story of me trying to find my way in the art world ",
    "URLs": [
      "https://ik.imagekit.io/openhouse/back%20cover%20-%20Angie%20Fabien.tif?updatedAt=1714488907238",
      "https://ik.imagekit.io/openhouse/IMG_7628%20-%20Angie%20Fabien.jpeg?updatedAt=1714488914862",
      "https://ik.imagekit.io/openhouse/IMG_7629%20-%20Angie%20Fabien.jpeg?updatedAt=1714488921626",
      "",
      ""
    ]
  },
  {
    "Name": "Madison Tran",
    "Instagram": "https://www.instagram.com/mads.gdes/?hl=en",
    "Website": "https://madisontran.cargo.site/",
    "Project Description": "<i>Viet Ingredients</i> is a two part project consisting of a publicly accessible, web based archive of Vietnamese ingredient packaging (vietingredients.com) and Nước Chấm, a scrapbook style publication that compiles my own written memories and familial anecdotes pertinent to my identity as an American person of Vietnamese descent.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/1%20-%20Madison%20Tran.png?updatedAt=1714488907394",
      "https://ik.imagekit.io/openhouse/2%20-%20Madison%20Tran.png?updatedAt=1714488914990",
      "https://ik.imagekit.io/openhouse/3%20-%20Madison%20Tran.png?updatedAt=1714488921790",
      "https://ik.imagekit.io/openhouse/4%20-%20Madison%20Tran.png?updatedAt=1714488926313",
      ""
    ]
  },
  {
    "Name": "eric couture",
    "Instagram": "https://www.are.na/eric-couture-5zn78wmr2i8/channels",
    "Website": "https://ecouture.net/",
    "Project Description": "<i>Recording Interface for Pair of Weavers</i> is a tool. The loom is intentionally designed for use by two people, weaving side by side simultaneously. Stemming from research into the archival and record keeping potential of handwoven cloth, the loom acts as an interface for the recording of an interaction between two people. The 8-shaft direct-tieup loom is a hybrid of many designs, but is unique in its focus not on the actual cloth it produces, but on what that cloth represents. This loom is not made for efficiency, for productivity, for practicality, or for profit. It’s a tool for documentation, archiving, and spending time with one another, creating something together.\n\nIt takes a village, and I would like to thank Justin, Annie, Elsie, Eileen, Hillary, Mishari, Joe, Piper, Emma, Gwen, Aimee, Ezra, Nora, Mom, Dad and all the other hands that helped put this thing together. This one’s for you Nate, miss you bud.\n",
    "URLs": [
      "https://ik.imagekit.io/openhouse/IMGP1268_SQUARE%20-%20Eric%20Couture.jpg?updatedAt=1714488907573",
      "https://ik.imagekit.io/openhouse/IMG_6016_SQUARE%20-%20Eric%20Couture.jpg?updatedAt=1714488915161",
      "https://ik.imagekit.io/openhouse/IMGP1275_SQUARE%20-%20Eric%20Couture.png?updatedAt=1714488921960",
      "https://ik.imagekit.io/openhouse/IMG_2270_SQUARE%20-%20Eric%20Couture.jpg?updatedAt=1714488926484",
      ""
    ]
  },
  {
    "Name": "Megan Caramico",
    "Instagram": "",
    "Website": "",
    "Project Description": "First Last Words is a death writing prompt book. Writing about death is one way to face anxieties about it. My main goal in making this book was to help people facing fears of death, leading them to start talking about it more. \n\nIt covers almost all topics related to death, including death rituals, bucket lists, writing to loved ones who have passed, final words, final meals, and the afterlife, just to name a few. Everyone’s experience with death differs, which is heavily considered. Anyone and everyone can complete the prompts; they are left vague on purpose. \n\nMost prompts are journal-style, but there are a few creative writing, drawing, and collaging prompts throughout the book. The prompts are divided into segments: life, grief, dying, dead, and afterlife. Between each segment is a transition page that includes definitions you may need.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/Megan%20Caramico%20Web%20Submission%20-%20Megan%20Caramico.jpg?updatedAt=1714488907749",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Ryan Daughtry",
    "Instagram": "",
    "Website": "",
    "Project Description": "Forgotten is a videogame in the making that is currently only sprite assets. It is a project that has needed months of research before starting with the expectation that it can eventually be uploaded into Unity Game Engine with the hopes of it becoming a real game in the near future. This research included figuring out how games are coded, how sizing is created for characters and maps, and how lighting and effects such as parallax backgrounds are made. The story revolves around the main character who has forgotten who they are as well as been forgotten by others. To complete the game, the player must collect memory shards and explore the areas of the map to uncover who the main character really is.",
    "URLs": [
      "",
      "https://ik.imagekit.io/openhouse/owl%20-%20Ryan%20Daughtry.png?updatedAt=1714488915310",
      "https://ik.imagekit.io/openhouse/shopkeeper-upload%20-%20Ryan%20Daughtry.png?updatedAt=1714488922111",
      "",
      ""
    ]
  },
  {
    "Name": "Priya Sugathan",
    "Instagram": "",
    "Website": "",
    "Project Description": "This care package will consume of a couple of different guides to help navigate woman in their twenties. Here we have a survival guide book, mini how to zines, a planner, and some stickers. These together as a care package are encompass the idea that stemmed from just the survival guide book. The survival guide showcases chapters that illuminate different types of topics such as finance, self care, independent responsibilities (etc). The mini how to zines stem from each chapter in the survival guide, the purpose it holds is because it's so mini, you are just able to put it in your pocket! As a woman going through her twenties right now, I wish I had a guide or multiple guides to assist me even before entering my twenties. I want this care package to be a helping hand for all the woman out there who are struggling on knowing where to start their journey as a twenty something year old. ",
    "URLs": [
      "https://ik.imagekit.io/openhouse/IMG_8046%20-%20Priya%20Sugathan.jpeg?updatedAt=1714488907914",
      "",
      "",
      "",
      ""
    ]
  }
]