[
  {
    "Name": "Student Name",
    "Instagram": "Social Media",
    "Website": "Website",
    "Project Description": "Project Description",
    "URLs": [
      "Image URL1",
      "Image URL 2",
      "Image URL 3",
      "Image URL 4",
      "Image URL 5"
    ]
  },
  {
    "Name": "Gabby Gilbert",
    "Instagram": "https://www.instagram.com/gxbbsofficixl/",
    "Website": "",
    "Project Description": "Cursed to Find Myself is my own personal breakup memoir that discusses themes of love, betrayal, heartache, and finding one’s self after it’s all over. This story encapsulates my thoughts and feelings during key moments in the midst of and after my relationship with my first love, and how I managed to drag myself out of my depressive slump to find out who I truly was. The book is written to follow a playlist of songs by Olivia Rodrigo, with pages filled with her lyrics to the songs I felt best suited my story and ones that resonated the most with me.It can be read with or without listening to the songs attached to each chapter, but it is just a way to further include the readers into my thoughts and feelings throughout the story, and even now as I look back on everything. If anyone reading this is going through anything similar, just know that you are not alone. Thank you for taking the time to unpack and read my story.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/IMG_0877%20-%20Gabrielle%20Gilbert.jpeg?updatedAt=1713534165127",
      "https://ik.imagekit.io/openhouse/IMG_0893%20-%20Gabrielle%20Gilbert.jpeg?updatedAt=1713534167474",
      "https://ik.imagekit.io/openhouse/IMG_0888%20-%20Gabrielle%20Gilbert.jpeg?updatedAt=1713534168332",
      "https://ik.imagekit.io/openhouse/IMG_0880%20-%20Gabrielle%20Gilbert.jpeg?updatedAt=1713534169431",
      ""
    ]
  },
  {
    "Name": "Inho Park",
    "Instagram": "https://www.instagram.com/par_kino/",
    "Website": "www.inhodesign.com",
    "Project Description": "The Viewport² music player provides a casing for your smartphone that intentionally degrades your technology. You will experience limited functions and worse-off quality, but also rediscover what it means to live in a highly digitized world.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/inho-park-1%20-%20Inho%20Park.jpg?updatedAt=1713534165328",
      "https://ik.imagekit.io/openhouse/inho-park-2%20-%20Inho%20Park.jpg?updatedAt=1713534167669",
      "https://ik.imagekit.io/openhouse/inho-park-3%20-%20Inho%20Park.jpg?updatedAt=1713534168542",
      "",
      ""
    ]
  },
  {
    "Name": "Jack Lwin",
    "Instagram": "",
    "Website": "https://jacklwin.cargo.site/",
    "Project Description": "This binder isn't really about sports. There are plenty of callbacks to the title but the word felt like such a perfect umbrella for what I want to communicate with this project. More than any athletic or historical reference this collection is about process and iteration.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/1%20-%20Jack%20Lwin.jpg?updatedAt=1713534165580",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Lillie Bloch",
    "Instagram": "",
    "Website": "https://lilliebloch.wixsite.com/my-portfolio",
    "Project Description": "My project focuses on obsessive-compulsive disorder and the effect it can have on one's life. Through mold imagery viewers can see how different obsessions take over and spread.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/december%20SQUARE%20-%20Lillie%20Bloch.png?updatedAt=1713534165739",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Meghan Andrews",
    "Instagram": "",
    "Website": "https://www.meghanandrewsportfolio.com/",
    "Project Description": "1,000 words is a website about alt text and image description, which are verbal descriptions of visual content found online. The website contains educational content, such as an “Introduction to alt text” section that defines both alt text and image description, and shows examples of what these might look like. There is also an interactive section of the website, providing the opportunity to practice writing alt text and image descriptions. Ultimately, 1,000 words is a space where one can learn, practice, and engage with alt text and image description.",
    "URLs": [
      "https://ik.imagekit.io/openhouse/one-thousand-words-1%20-%20Meghan%20Andrews.jpg?updatedAt=1713534165965",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Joy Lee",
    "Instagram": "https://www.instagram.com/local_art_gremlin/",
    "Website": "https://joyjialeart.wordpress.com/",
    "Project Description": "Penny and the Land of Grief is a children’s book that describes the five stages of grief as cities that you travel through. Grief is not a linear process, regardless of what we like to believe. You can spend a long time in anger, or bounce between depression and denial. But regardless of what “city” you’re in, the end of that journey is always going to be acceptance. I wanted to be able to provide both children and adults with the language that we sometimes find ourselves lacking when are going through hard times, such as the death of a family member, the loss of our home, or the end of a friendship. ",
    "URLs": [
      "https://ik.imagekit.io/openhouse/Penny%20and%20the%20Land%20of%20Grief%20(square%20aspect%20ratio)%20-%20Joy%20Lee.jpg?updatedAt=1713534166121",
      "",
      "",
      "",
      ""
    ]
  },
  {
    "Name": "Jade Stella",
    "Instagram": "https://www.instagram.com/stellerforever/",
    "Website": "https://jadestella.cargo.site/",
    "Project Description": "“And here I still stand.” A sentiment that has been growing more and more necessary. “I’m here. I’m here and I’m still standing.” When the whole world feels as if it’s floating away and I have nothing to hold on to, how can I reroot myself again? When the things that were once thought as promised, are not, where can I look to find safety again? When everything once grasped tight is lost, how can I trust these hands again? Where can I place my hopes, where can I place my dreams, where can I find a soft place to land?",
    "URLs": [
      "https://ik.imagekit.io/openhouse/synthesis%20web%20photos1%20-%20Jade%20Stella.png?updatedAt=1713534166736",
      "https://ik.imagekit.io/openhouse/synthesis%20web%20photos2%20-%20Jade%20Stella.png?updatedAt=1713534167875",
      "https://ik.imagekit.io/openhouse/synthesis%20web%20photos3%20-%20Jade%20Stella.png?updatedAt=1713534168837",
      "https://ik.imagekit.io/openhouse/synthesis%20web%20photos4%20-%20Jade%20Stella.png?updatedAt=1713534169660",
      "https://ik.imagekit.io/openhouse/synthesis%20web%20photos5%20-%20Jade%20Stella.png?updatedAt=1713534170216"
    ]
  }
]